Siege/ab_logi_no_scaling_100_4000/log_search_ab_2800.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 5000 requests
Completed 10000 requests
Completed 15000 requests
Finished 15580 requests


Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/property/search/?city=Warszawa&region=Mazowieckie&maxP=330
Document Length:        15859 bytes

Concurrency Level:      2800
Time taken for tests:   60.006 seconds
Complete requests:      15580
Failed requests:        0
Total transferred:      252147323 bytes
HTML transferred:       247099079 bytes
Requests per second:    259.64 [#/sec] (mean)
Time per request:       10784.162 [ms] (mean)
Time per request:       3.851 [ms] (mean, across all concurrent requests)
Transfer rate:          4103.54 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   23  61.0      0     239
Processing:   387 6854 2104.0   6455   53384
Waiting:      387 6854 2104.1   6455   53383
Total:        626 6878 2071.8   6456   53496

Percentage of the requests served within a certain time (ms)
  50%   6456
  66%   6921
  75%   7223
  80%   7328
  90%   9984
  95%  11612
  98%  11892
  99%  11897
 100%  53496 (longest request)