Siege/ab_logi_no_scaling_100_4000/log_search_ab_3500.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 5000 requests
Completed 10000 requests
Completed 15000 requests
Finished 17659 requests


Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/property/search/?city=Warszawa&region=Mazowieckie&maxP=330
Document Length:        15859 bytes

Concurrency Level:      3500
Time taken for tests:   60.002 seconds
Complete requests:      17659
Failed requests:        278
   (Connect: 0, Receive: 0, Length: 278, Exceptions: 0)
Total transferred:      281276723 bytes
HTML transferred:       275645279 bytes
Requests per second:    294.31 [#/sec] (mean)
Time per request:       11892.274 [ms] (mean)
Time per request:       3.398 [ms] (mean, across all concurrent requests)
Transfer rate:          4577.95 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   24  63.0      0     235
Processing:   218 6469 1762.3   6455   46159
Waiting:        0 6225 1557.7   6430   46158
Total:        453 6493 1746.7   6459   46250

Percentage of the requests served within a certain time (ms)
  50%   6459
  66%   6596
  75%   6713
  80%   6797
  90%   7013
  95%   7779
  98%   8918
  99%  15571
 100%  46250 (longest request)