Siege/ab_logi_no_scaling_100_4000/log_search_ab_400.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 5000 requests
Completed 10000 requests
Completed 15000 requests
Finished 19247 requests


Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/property/search/?city=Warszawa&region=Mazowieckie&maxP=330
Document Length:        15859 bytes

Concurrency Level:      400
Time taken for tests:   60.007 seconds
Complete requests:      19247
Failed requests:        0
Total transferred:      311474201 bytes
HTML transferred:       305238173 bytes
Requests per second:    320.75 [#/sec] (mean)
Time per request:       1247.083 [ms] (mean)
Time per request:       3.118 [ms] (mean, across all concurrent requests)
Transfer rate:          5069.02 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   2.2      0      23
Processing:    12 1231 178.2   1170    1659
Waiting:        9 1230 178.2   1170    1659
Total:         35 1231 176.9   1170    1660

Percentage of the requests served within a certain time (ms)
  50%   1170
  66%   1228
  75%   1316
  80%   1400
  90%   1488
  95%   1517
  98%   1561
  99%   1632
 100%   1660 (longest request)