Siege/ab_logi_no_scaling_100_4000/log_search_ab_800.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 5000 requests
Completed 10000 requests
Completed 15000 requests
Finished 19295 requests


Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/property/search/?city=Warszawa&region=Mazowieckie&maxP=330
Document Length:        15859 bytes

Concurrency Level:      800
Time taken for tests:   60.001 seconds
Complete requests:      19295
Failed requests:        0
Total transferred:      312250985 bytes
HTML transferred:       305999405 bytes
Requests per second:    321.58 [#/sec] (mean)
Time per request:       2487.726 [ms] (mean)
Time per request:       3.110 [ms] (mean, across all concurrent requests)
Transfer rate:          5082.14 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   6.6      0      42
Processing:    22 2424 379.0   2376    2997
Waiting:       10 2424 379.0   2376    2996
Total:         64 2426 374.2   2376    2997

Percentage of the requests served within a certain time (ms)
  50%   2376
  66%   2438
  75%   2511
  80%   2811
  90%   2906
  95%   2943
  98%   2975
  99%   2979
 100%   2997 (longest request)